<?php
/**
 * @file
 * scale_schedule.pages_default.inc
 */

/**
 * Implements hook_default_page_manager_pages().
 */
function scale_schedule_default_page_manager_pages() {
  $page = new stdClass();
  $page->disabled = FALSE; /* Edit this to true to make a default page disabled initially */
  $page->api_version = 1;
  $page->name = 'schedule';
  $page->task = 'page';
  $page->admin_title = 'Schedule';
  $page->admin_description = '';
  $page->path = 'scale11x/schedule';
  $page->access = array(
    'logic' => 'and',
    'plugins' => array(),
  );
  $page->menu = array(
    'type' => 'none',
    'title' => '',
    'name' => 'navigation',
    'weight' => '0',
    'parent' => array(
      'type' => 'none',
      'title' => '',
      'name' => 'navigation',
      'weight' => '0',
    ),
  );
  $page->arguments = array();
  $page->conf = array(
    'admin_paths' => FALSE,
  );
  $page->default_handlers = array();
  $pages['schedule'] = $page;

  $page = new stdClass();
  $page->disabled = FALSE; /* Edit this to true to make a default page disabled initially */
  $page->api_version = 1;
  $page->name = 'schedule_12x';
  $page->task = 'page';
  $page->admin_title = 'Schedule 12x';
  $page->admin_description = '';
  $page->path = 'scale12x/schedule';
  $page->access = array(
    'logic' => 'and',
    'plugins' => array(),
  );
  $page->menu = array(
    'type' => 'none',
    'title' => '',
    'name' => 'navigation',
    'weight' => '0',
    'parent' => array(
      'type' => 'none',
      'title' => '',
      'name' => 'navigation',
      'weight' => '0',
    ),
  );
  $page->arguments = array();
  $page->conf = array(
    'admin_paths' => FALSE,
  );
  $page->default_handlers = array();
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_12x_panel_context';
  $handler->task = 'page';
  $handler->subtask = 'schedule_12x';
  $handler->handler = 'panel_context';
  $handler->weight = 0;
  $handler->conf = array(
    'title' => 'Friday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale12x/schedule/friday
scale12x/schedule/2014-02-21',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Friday, February 21, 2014';
  $display->uuid = '92089581-0ae6-4944-b71f-070fdaae4a14';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-797d2aad-95bd-4528-a806-d31fa0ea31c0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/454',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'La Jolla',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '797d2aad-95bd-4528-a806-d31fa0ea31c0';
  $display->content['new-797d2aad-95bd-4528-a806-d31fa0ea31c0'] = $pane;
  $display->panels['center'][0] = 'new-797d2aad-95bd-4528-a806-d31fa0ea31c0';
  $pane = new stdClass();
  $pane->pid = 'new-0446fd26-7850-42e8-9d4f-0ae6ecf370d1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/442',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Carmel',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '0446fd26-7850-42e8-9d4f-0ae6ecf370d1';
  $display->content['new-0446fd26-7850-42e8-9d4f-0ae6ecf370d1'] = $pane;
  $display->panels['center'][1] = 'new-0446fd26-7850-42e8-9d4f-0ae6ecf370d1';
  $pane = new stdClass();
  $pane->pid = 'new-0a28af51-fab8-4e23-b7fa-ad1d74dbcca7';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/455',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = '0a28af51-fab8-4e23-b7fa-ad1d74dbcca7';
  $display->content['new-0a28af51-fab8-4e23-b7fa-ad1d74dbcca7'] = $pane;
  $display->panels['center'][2] = 'new-0a28af51-fab8-4e23-b7fa-ad1d74dbcca7';
  $pane = new stdClass();
  $pane->pid = 'new-71967a3e-46e6-4b33-bf2f-b1563710e02c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/457',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '71967a3e-46e6-4b33-bf2f-b1563710e02c';
  $display->content['new-71967a3e-46e6-4b33-bf2f-b1563710e02c'] = $pane;
  $display->panels['center'][3] = 'new-71967a3e-46e6-4b33-bf2f-b1563710e02c';
  $pane = new stdClass();
  $pane->pid = 'new-005d2d87-3f9c-45fe-829b-ba113e53cd2d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/458',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '005d2d87-3f9c-45fe-829b-ba113e53cd2d';
  $display->content['new-005d2d87-3f9c-45fe-829b-ba113e53cd2d'] = $pane;
  $display->panels['center'][4] = 'new-005d2d87-3f9c-45fe-829b-ba113e53cd2d';
  $pane = new stdClass();
  $pane->pid = 'new-a37896a4-1ff8-43d4-bc2d-808c4772e810';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/448',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century AB',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'a37896a4-1ff8-43d4-bc2d-808c4772e810';
  $display->content['new-a37896a4-1ff8-43d4-bc2d-808c4772e810'] = $pane;
  $display->panels['center'][5] = 'new-a37896a4-1ff8-43d4-bc2d-808c4772e810';
  $pane = new stdClass();
  $pane->pid = 'new-32ae4841-9272-41fc-9329-8a605fb584ef';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/451',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century CD',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '32ae4841-9272-41fc-9329-8a605fb584ef';
  $display->content['new-32ae4841-9272-41fc-9329-8a605fb584ef'] = $pane;
  $display->panels['center'][6] = 'new-32ae4841-9272-41fc-9329-8a605fb584ef';
  $pane = new stdClass();
  $pane->pid = 'new-f36d87d0-48d8-4246-be69-d380d7271ebc';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/459',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Marina',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = 'f36d87d0-48d8-4246-be69-d380d7271ebc';
  $display->content['new-f36d87d0-48d8-4246-be69-d380d7271ebc'] = $pane;
  $display->panels['center'][7] = 'new-f36d87d0-48d8-4246-be69-d380d7271ebc';
  $pane = new stdClass();
  $pane->pid = 'new-b8d63ca5-aaec-4620-9330-40c8dcbf2269';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/441',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Bel Air',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = 'b8d63ca5-aaec-4620-9330-40c8dcbf2269';
  $display->content['new-b8d63ca5-aaec-4620-9330-40c8dcbf2269'] = $pane;
  $display->panels['center'][8] = 'new-b8d63ca5-aaec-4620-9330-40c8dcbf2269';
  $pane = new stdClass();
  $pane->pid = 'new-14aa7c76-f1b5-4359-b81c-fcf8c27171b7';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/462',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '14aa7c76-f1b5-4359-b81c-fcf8c27171b7';
  $display->content['new-14aa7c76-f1b5-4359-b81c-fcf8c27171b7'] = $pane;
  $display->panels['center'][9] = 'new-14aa7c76-f1b5-4359-b81c-fcf8c27171b7';
  $pane = new stdClass();
  $pane->pid = 'new-5fd9f6bb-84a2-473e-88a0-0ef1a7b2663f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/463',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = '5fd9f6bb-84a2-473e-88a0-0ef1a7b2663f';
  $display->content['new-5fd9f6bb-84a2-473e-88a0-0ef1a7b2663f'] = $pane;
  $display->panels['center'][10] = 'new-5fd9f6bb-84a2-473e-88a0-0ef1a7b2663f';
  $pane = new stdClass();
  $pane->pid = 'new-1f181a1e-e107-4f42-aa21-390a804b092b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/464',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '1f181a1e-e107-4f42-aa21-390a804b092b';
  $display->content['new-1f181a1e-e107-4f42-aa21-390a804b092b'] = $pane;
  $display->panels['center'][11] = 'new-1f181a1e-e107-4f42-aa21-390a804b092b';
  $pane = new stdClass();
  $pane->pid = 'new-3361857c-2615-4d08-90d8-0e6cbaadb182';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/465',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '3361857c-2615-4d08-90d8-0e6cbaadb182';
  $display->content['new-3361857c-2615-4d08-90d8-0e6cbaadb182'] = $pane;
  $display->panels['center'][12] = 'new-3361857c-2615-4d08-90d8-0e6cbaadb182';
  $pane = new stdClass();
  $pane->pid = 'new-46ae1421-07a3-4b70-b315-641d478f35e1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/466',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo D',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '46ae1421-07a3-4b70-b315-641d478f35e1';
  $display->content['new-46ae1421-07a3-4b70-b315-641d478f35e1'] = $pane;
  $display->panels['center'][13] = 'new-46ae1421-07a3-4b70-b315-641d478f35e1';
  $pane = new stdClass();
  $pane->pid = 'new-b3e5efe3-8f6d-47b8-99a5-0a5b7035f645';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/467',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo E',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = 'b3e5efe3-8f6d-47b8-99a5-0a5b7035f645';
  $display->content['new-b3e5efe3-8f6d-47b8-99a5-0a5b7035f645'] = $pane;
  $display->panels['center'][14] = 'new-b3e5efe3-8f6d-47b8-99a5-0a5b7035f645';
  $pane = new stdClass();
  $pane->pid = 'new-8c73ddce-732b-46e0-9609-125296211a87';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21/468',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo F',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '8c73ddce-732b-46e0-9609-125296211a87';
  $display->content['new-8c73ddce-732b-46e0-9609-125296211a87'] = $pane;
  $display->panels['center'][15] = 'new-8c73ddce-732b-46e0-9609-125296211a87';
  $pane = new stdClass();
  $pane->pid = 'new-3b8499c5-af72-4de2-b24e-03c35b0f7cd2';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '3b8499c5-af72-4de2-b24e-03c35b0f7cd2';
  $display->content['new-3b8499c5-af72-4de2-b24e-03c35b0f7cd2'] = $pane;
  $display->panels['notice'][0] = 'new-3b8499c5-af72-4de2-b24e-03c35b0f7cd2';
  $pane = new stdClass();
  $pane->pid = 'new-bb63e74d-1c15-44fe-b091-4619244b49fe';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-21',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'bb63e74d-1c15-44fe-b091-4619244b49fe';
  $display->content['new-bb63e74d-1c15-44fe-b091-4619244b49fe'] = $pane;
  $display->panels['notice'][1] = 'new-bb63e74d-1c15-44fe-b091-4619244b49fe';
  $pane = new stdClass();
  $pane->pid = 'new-3ae00597-842c-4ffa-8fa9-7abde548293f';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-12x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '3ae00597-842c-4ffa-8fa9-7abde548293f';
  $display->content['new-3ae00597-842c-4ffa-8fa9-7abde548293f'] = $pane;
  $display->panels['schedule_top'][0] = 'new-3ae00597-842c-4ffa-8fa9-7abde548293f';
  $pane = new stdClass();
  $pane->pid = 'new-f63c03f8-96f3-4c84-ad2b-60cb0d791587';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-21',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'f63c03f8-96f3-4c84-ad2b-60cb0d791587';
  $display->content['new-f63c03f8-96f3-4c84-ad2b-60cb0d791587'] = $pane;
  $display->panels['schedule_top'][1] = 'new-f63c03f8-96f3-4c84-ad2b-60cb0d791587';
  $pane = new stdClass();
  $pane->pid = 'new-0ec60037-97a2-4feb-be7e-a151f8d1e85d';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-21',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '0ec60037-97a2-4feb-be7e-a151f8d1e85d';
  $display->content['new-0ec60037-97a2-4feb-be7e-a151f8d1e85d'] = $pane;
  $display->panels['time'][0] = 'new-0ec60037-97a2-4feb-be7e-a151f8d1e85d';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_12x_panel_context_2';
  $handler->task = 'page';
  $handler->subtask = 'schedule_12x';
  $handler->handler = 'panel_context';
  $handler->weight = 1;
  $handler->conf = array(
    'title' => 'Saturday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x saturday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale12x/schedule/saturday
scale12x/schedule/2014-02-22',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Saturday, February 22, 2014';
  $display->uuid = '02a05269-e027-418e-8b29-bc494c777228';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-9405c537-758d-4e0e-9481-6e3f3387af92';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/454',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'La Jolla',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '9405c537-758d-4e0e-9481-6e3f3387af92';
  $display->content['new-9405c537-758d-4e0e-9481-6e3f3387af92'] = $pane;
  $display->panels['center'][0] = 'new-9405c537-758d-4e0e-9481-6e3f3387af92';
  $pane = new stdClass();
  $pane->pid = 'new-44b3305d-c210-4014-b9b0-6c6b2460b2da';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/442',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Carmel',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '44b3305d-c210-4014-b9b0-6c6b2460b2da';
  $display->content['new-44b3305d-c210-4014-b9b0-6c6b2460b2da'] = $pane;
  $display->panels['center'][1] = 'new-44b3305d-c210-4014-b9b0-6c6b2460b2da';
  $pane = new stdClass();
  $pane->pid = 'new-d13a6e72-3760-4dcb-9359-1508d7f152dc';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/455',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'd13a6e72-3760-4dcb-9359-1508d7f152dc';
  $display->content['new-d13a6e72-3760-4dcb-9359-1508d7f152dc'] = $pane;
  $display->panels['center'][2] = 'new-d13a6e72-3760-4dcb-9359-1508d7f152dc';
  $pane = new stdClass();
  $pane->pid = 'new-056923bd-d300-47ad-92e5-b0c6e8b17b5b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/457',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '056923bd-d300-47ad-92e5-b0c6e8b17b5b';
  $display->content['new-056923bd-d300-47ad-92e5-b0c6e8b17b5b'] = $pane;
  $display->panels['center'][3] = 'new-056923bd-d300-47ad-92e5-b0c6e8b17b5b';
  $pane = new stdClass();
  $pane->pid = 'new-45015b2d-4c20-4da9-9748-b9ca42cee867';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/458',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '45015b2d-4c20-4da9-9748-b9ca42cee867';
  $display->content['new-45015b2d-4c20-4da9-9748-b9ca42cee867'] = $pane;
  $display->panels['center'][4] = 'new-45015b2d-4c20-4da9-9748-b9ca42cee867';
  $pane = new stdClass();
  $pane->pid = 'new-45afac5e-a58a-40f2-8243-a50c90cff7a7';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/448',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century AB',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = '45afac5e-a58a-40f2-8243-a50c90cff7a7';
  $display->content['new-45afac5e-a58a-40f2-8243-a50c90cff7a7'] = $pane;
  $display->panels['center'][5] = 'new-45afac5e-a58a-40f2-8243-a50c90cff7a7';
  $pane = new stdClass();
  $pane->pid = 'new-66309689-e80c-4541-b02d-797a2b758dc0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/451',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century CD',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '66309689-e80c-4541-b02d-797a2b758dc0';
  $display->content['new-66309689-e80c-4541-b02d-797a2b758dc0'] = $pane;
  $display->panels['center'][6] = 'new-66309689-e80c-4541-b02d-797a2b758dc0';
  $pane = new stdClass();
  $pane->pid = 'new-332e4a9a-9690-4899-ade5-2cb7a796c656';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/459',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Marina',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '332e4a9a-9690-4899-ade5-2cb7a796c656';
  $display->content['new-332e4a9a-9690-4899-ade5-2cb7a796c656'] = $pane;
  $display->panels['center'][7] = 'new-332e4a9a-9690-4899-ade5-2cb7a796c656';
  $pane = new stdClass();
  $pane->pid = 'new-db474781-1659-4bb9-a110-25a9a16a145f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/441',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Bel Air',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = 'db474781-1659-4bb9-a110-25a9a16a145f';
  $display->content['new-db474781-1659-4bb9-a110-25a9a16a145f'] = $pane;
  $display->panels['center'][8] = 'new-db474781-1659-4bb9-a110-25a9a16a145f';
  $pane = new stdClass();
  $pane->pid = 'new-88d6720d-e162-456a-8cee-95142e7af99b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/462',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '88d6720d-e162-456a-8cee-95142e7af99b';
  $display->content['new-88d6720d-e162-456a-8cee-95142e7af99b'] = $pane;
  $display->panels['center'][9] = 'new-88d6720d-e162-456a-8cee-95142e7af99b';
  $pane = new stdClass();
  $pane->pid = 'new-d9bbb300-e9ba-4b9d-a2bb-372e3c2643cd';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/463',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = 'd9bbb300-e9ba-4b9d-a2bb-372e3c2643cd';
  $display->content['new-d9bbb300-e9ba-4b9d-a2bb-372e3c2643cd'] = $pane;
  $display->panels['center'][10] = 'new-d9bbb300-e9ba-4b9d-a2bb-372e3c2643cd';
  $pane = new stdClass();
  $pane->pid = 'new-9d48e327-6b6b-4d5e-8647-de750c85987c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/464',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '9d48e327-6b6b-4d5e-8647-de750c85987c';
  $display->content['new-9d48e327-6b6b-4d5e-8647-de750c85987c'] = $pane;
  $display->panels['center'][11] = 'new-9d48e327-6b6b-4d5e-8647-de750c85987c';
  $pane = new stdClass();
  $pane->pid = 'new-09331b34-a989-47ae-a524-283cffdd7830';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/465',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '09331b34-a989-47ae-a524-283cffdd7830';
  $display->content['new-09331b34-a989-47ae-a524-283cffdd7830'] = $pane;
  $display->panels['center'][12] = 'new-09331b34-a989-47ae-a524-283cffdd7830';
  $pane = new stdClass();
  $pane->pid = 'new-44152985-2daf-45fe-8a94-b61a63330d08';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/466',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo D',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '44152985-2daf-45fe-8a94-b61a63330d08';
  $display->content['new-44152985-2daf-45fe-8a94-b61a63330d08'] = $pane;
  $display->panels['center'][13] = 'new-44152985-2daf-45fe-8a94-b61a63330d08';
  $pane = new stdClass();
  $pane->pid = 'new-6b0b64f1-174d-426d-9b4d-b5f1e69e243a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/467',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo E',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '6b0b64f1-174d-426d-9b4d-b5f1e69e243a';
  $display->content['new-6b0b64f1-174d-426d-9b4d-b5f1e69e243a'] = $pane;
  $display->panels['center'][14] = 'new-6b0b64f1-174d-426d-9b4d-b5f1e69e243a';
  $pane = new stdClass();
  $pane->pid = 'new-52add213-ffcc-457c-b207-5a789f9754a1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/468',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo F',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '52add213-ffcc-457c-b207-5a789f9754a1';
  $display->content['new-52add213-ffcc-457c-b207-5a789f9754a1'] = $pane;
  $display->panels['center'][15] = 'new-52add213-ffcc-457c-b207-5a789f9754a1';
  $pane = new stdClass();
  $pane->pid = 'new-c6540ea7-2bf8-4ebd-b3b9-1a97899417b3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/461',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Plaza Ballroom',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = 'c6540ea7-2bf8-4ebd-b3b9-1a97899417b3';
  $display->content['new-c6540ea7-2bf8-4ebd-b3b9-1a97899417b3'] = $pane;
  $display->panels['center'][16] = 'new-c6540ea7-2bf8-4ebd-b3b9-1a97899417b3';
  $pane = new stdClass();
  $pane->pid = 'new-8e1d3eae-defd-4db1-a6e0-663d57c2d25e';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22/453',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Expo',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '8e1d3eae-defd-4db1-a6e0-663d57c2d25e';
  $display->content['new-8e1d3eae-defd-4db1-a6e0-663d57c2d25e'] = $pane;
  $display->panels['center'][17] = 'new-8e1d3eae-defd-4db1-a6e0-663d57c2d25e';
  $pane = new stdClass();
  $pane->pid = 'new-0219f664-f279-493d-9cbd-1f2072d880a6';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '0219f664-f279-493d-9cbd-1f2072d880a6';
  $display->content['new-0219f664-f279-493d-9cbd-1f2072d880a6'] = $pane;
  $display->panels['notice'][0] = 'new-0219f664-f279-493d-9cbd-1f2072d880a6';
  $pane = new stdClass();
  $pane->pid = 'new-b3b5bfcf-94ec-4668-be9d-eb2b3d1e0e68';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-22',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'b3b5bfcf-94ec-4668-be9d-eb2b3d1e0e68';
  $display->content['new-b3b5bfcf-94ec-4668-be9d-eb2b3d1e0e68'] = $pane;
  $display->panels['notice'][1] = 'new-b3b5bfcf-94ec-4668-be9d-eb2b3d1e0e68';
  $pane = new stdClass();
  $pane->pid = 'new-4e3d34e1-48ee-4bb0-b261-35f8a3f67239';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-12x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '4e3d34e1-48ee-4bb0-b261-35f8a3f67239';
  $display->content['new-4e3d34e1-48ee-4bb0-b261-35f8a3f67239'] = $pane;
  $display->panels['schedule_top'][0] = 'new-4e3d34e1-48ee-4bb0-b261-35f8a3f67239';
  $pane = new stdClass();
  $pane->pid = 'new-2dce60d7-1d4d-4cc8-9324-c7c95f940b3e';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-22',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '2dce60d7-1d4d-4cc8-9324-c7c95f940b3e';
  $display->content['new-2dce60d7-1d4d-4cc8-9324-c7c95f940b3e'] = $pane;
  $display->panels['schedule_top'][1] = 'new-2dce60d7-1d4d-4cc8-9324-c7c95f940b3e';
  $pane = new stdClass();
  $pane->pid = 'new-e54fdf3d-8393-4897-b688-cf50a2f7dbb0';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-22',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'e54fdf3d-8393-4897-b688-cf50a2f7dbb0';
  $display->content['new-e54fdf3d-8393-4897-b688-cf50a2f7dbb0'] = $pane;
  $display->panels['time'][0] = 'new-e54fdf3d-8393-4897-b688-cf50a2f7dbb0';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_12x_panel_context_3';
  $handler->task = 'page';
  $handler->subtask = 'schedule_12x';
  $handler->handler = 'panel_context';
  $handler->weight = 2;
  $handler->conf = array(
    'title' => 'Sunday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x sunday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale12x/schedule/sunday
scale12x/schedule/2014-02-23
scale12x/blah',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Sunday, February 23, 2014';
  $display->uuid = 'b6e4aea3-885a-49a2-a4ee-0dbcb3d61394';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-61002e5a-ed2a-4506-91d8-1b5070d50188';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/454',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'La Jolla',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '61002e5a-ed2a-4506-91d8-1b5070d50188';
  $display->content['new-61002e5a-ed2a-4506-91d8-1b5070d50188'] = $pane;
  $display->panels['center'][0] = 'new-61002e5a-ed2a-4506-91d8-1b5070d50188';
  $pane = new stdClass();
  $pane->pid = 'new-9b274afd-4bba-468f-beec-13f4ba8648df';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/442',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Carmel',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '9b274afd-4bba-468f-beec-13f4ba8648df';
  $display->content['new-9b274afd-4bba-468f-beec-13f4ba8648df'] = $pane;
  $display->panels['center'][1] = 'new-9b274afd-4bba-468f-beec-13f4ba8648df';
  $pane = new stdClass();
  $pane->pid = 'new-b15e1331-e423-4b78-95fe-a7d236299652';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/455',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'b15e1331-e423-4b78-95fe-a7d236299652';
  $display->content['new-b15e1331-e423-4b78-95fe-a7d236299652'] = $pane;
  $display->panels['center'][2] = 'new-b15e1331-e423-4b78-95fe-a7d236299652';
  $pane = new stdClass();
  $pane->pid = 'new-ac03c543-a2ad-4d73-aa06-73350e93605d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/457',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'ac03c543-a2ad-4d73-aa06-73350e93605d';
  $display->content['new-ac03c543-a2ad-4d73-aa06-73350e93605d'] = $pane;
  $display->panels['center'][3] = 'new-ac03c543-a2ad-4d73-aa06-73350e93605d';
  $pane = new stdClass();
  $pane->pid = 'new-b716b2cb-fa41-4f9d-99c3-b6815f61a426';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/458',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Los Angeles C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = 'b716b2cb-fa41-4f9d-99c3-b6815f61a426';
  $display->content['new-b716b2cb-fa41-4f9d-99c3-b6815f61a426'] = $pane;
  $display->panels['center'][4] = 'new-b716b2cb-fa41-4f9d-99c3-b6815f61a426';
  $pane = new stdClass();
  $pane->pid = 'new-251013f1-bc8c-4f40-a70d-be1a833e4a1a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/448',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century AB',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = '251013f1-bc8c-4f40-a70d-be1a833e4a1a';
  $display->content['new-251013f1-bc8c-4f40-a70d-be1a833e4a1a'] = $pane;
  $display->panels['center'][5] = 'new-251013f1-bc8c-4f40-a70d-be1a833e4a1a';
  $pane = new stdClass();
  $pane->pid = 'new-6238a3ea-e1e7-4ed4-9ca5-1fd4abde8124';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/451',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Century CD',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '6238a3ea-e1e7-4ed4-9ca5-1fd4abde8124';
  $display->content['new-6238a3ea-e1e7-4ed4-9ca5-1fd4abde8124'] = $pane;
  $display->panels['center'][6] = 'new-6238a3ea-e1e7-4ed4-9ca5-1fd4abde8124';
  $pane = new stdClass();
  $pane->pid = 'new-4d681c3b-2af8-43ca-8aa3-637a0ed40d95';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/459',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Marina',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '4d681c3b-2af8-43ca-8aa3-637a0ed40d95';
  $display->content['new-4d681c3b-2af8-43ca-8aa3-637a0ed40d95'] = $pane;
  $display->panels['center'][7] = 'new-4d681c3b-2af8-43ca-8aa3-637a0ed40d95';
  $pane = new stdClass();
  $pane->pid = 'new-e43e47fa-0f3c-4c22-ba6d-72ce02b5a4a2';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/441',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Bel Air',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = 'e43e47fa-0f3c-4c22-ba6d-72ce02b5a4a2';
  $display->content['new-e43e47fa-0f3c-4c22-ba6d-72ce02b5a4a2'] = $pane;
  $display->panels['center'][8] = 'new-e43e47fa-0f3c-4c22-ba6d-72ce02b5a4a2';
  $pane = new stdClass();
  $pane->pid = 'new-7fc44828-220c-4a8f-aa97-e2ff5f6fbab8';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/462',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica A',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '7fc44828-220c-4a8f-aa97-e2ff5f6fbab8';
  $display->content['new-7fc44828-220c-4a8f-aa97-e2ff5f6fbab8'] = $pane;
  $display->panels['center'][9] = 'new-7fc44828-220c-4a8f-aa97-e2ff5f6fbab8';
  $pane = new stdClass();
  $pane->pid = 'new-390166fa-552e-4a4b-aea7-941a45b11a25';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/463',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Santa Monica B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = '390166fa-552e-4a4b-aea7-941a45b11a25';
  $display->content['new-390166fa-552e-4a4b-aea7-941a45b11a25'] = $pane;
  $display->panels['center'][10] = 'new-390166fa-552e-4a4b-aea7-941a45b11a25';
  $pane = new stdClass();
  $pane->pid = 'new-b995622d-0424-46a7-9ba8-801235f0ad11';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/464',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo B',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = 'b995622d-0424-46a7-9ba8-801235f0ad11';
  $display->content['new-b995622d-0424-46a7-9ba8-801235f0ad11'] = $pane;
  $display->panels['center'][11] = 'new-b995622d-0424-46a7-9ba8-801235f0ad11';
  $pane = new stdClass();
  $pane->pid = 'new-aa880ed2-666f-47b2-b054-e4a70ba59714';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/465',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo C',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = 'aa880ed2-666f-47b2-b054-e4a70ba59714';
  $display->content['new-aa880ed2-666f-47b2-b054-e4a70ba59714'] = $pane;
  $display->panels['center'][12] = 'new-aa880ed2-666f-47b2-b054-e4a70ba59714';
  $pane = new stdClass();
  $pane->pid = 'new-f56f6687-b308-444e-9644-4dbc8f5d9ff3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/466',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo D',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = 'f56f6687-b308-444e-9644-4dbc8f5d9ff3';
  $display->content['new-f56f6687-b308-444e-9644-4dbc8f5d9ff3'] = $pane;
  $display->panels['center'][13] = 'new-f56f6687-b308-444e-9644-4dbc8f5d9ff3';
  $pane = new stdClass();
  $pane->pid = 'new-3ae2e1e5-92e4-45ce-aa9c-3abf171db625';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/467',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo E',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '3ae2e1e5-92e4-45ce-aa9c-3abf171db625';
  $display->content['new-3ae2e1e5-92e4-45ce-aa9c-3abf171db625'] = $pane;
  $display->panels['center'][14] = 'new-3ae2e1e5-92e4-45ce-aa9c-3abf171db625';
  $pane = new stdClass();
  $pane->pid = 'new-bc9d9c69-5cf6-4c9f-bbf5-2c5d61c3b151';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/468',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'San Lorenzo F',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = 'bc9d9c69-5cf6-4c9f-bbf5-2c5d61c3b151';
  $display->content['new-bc9d9c69-5cf6-4c9f-bbf5-2c5d61c3b151'] = $pane;
  $display->panels['center'][15] = 'new-bc9d9c69-5cf6-4c9f-bbf5-2c5d61c3b151';
  $pane = new stdClass();
  $pane->pid = 'new-c5aca600-e471-4898-9318-7e6b9251188f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23/453',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Expo',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = 'c5aca600-e471-4898-9318-7e6b9251188f';
  $display->content['new-c5aca600-e471-4898-9318-7e6b9251188f'] = $pane;
  $display->panels['center'][16] = 'new-c5aca600-e471-4898-9318-7e6b9251188f';
  $pane = new stdClass();
  $pane->pid = 'new-8c78b0ad-d201-41d7-925d-c30276be0d75';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '8c78b0ad-d201-41d7-925d-c30276be0d75';
  $display->content['new-8c78b0ad-d201-41d7-925d-c30276be0d75'] = $pane;
  $display->panels['notice'][0] = 'new-8c78b0ad-d201-41d7-925d-c30276be0d75';
  $pane = new stdClass();
  $pane->pid = 'new-15d1144f-7324-48a5-a355-e6ea4bbc7abb';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-23',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '15d1144f-7324-48a5-a355-e6ea4bbc7abb';
  $display->content['new-15d1144f-7324-48a5-a355-e6ea4bbc7abb'] = $pane;
  $display->panels['notice'][1] = 'new-15d1144f-7324-48a5-a355-e6ea4bbc7abb';
  $pane = new stdClass();
  $pane->pid = 'new-fd1b1378-e8fc-4fea-b4ec-322b93bb62fd';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-12x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'fd1b1378-e8fc-4fea-b4ec-322b93bb62fd';
  $display->content['new-fd1b1378-e8fc-4fea-b4ec-322b93bb62fd'] = $pane;
  $display->panels['schedule_top'][0] = 'new-fd1b1378-e8fc-4fea-b4ec-322b93bb62fd';
  $pane = new stdClass();
  $pane->pid = 'new-d93c4c53-4d6f-4f8d-8a20-79d6ec004607';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2014-02-23',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'd93c4c53-4d6f-4f8d-8a20-79d6ec004607';
  $display->content['new-d93c4c53-4d6f-4f8d-8a20-79d6ec004607'] = $pane;
  $display->panels['schedule_top'][1] = 'new-d93c4c53-4d6f-4f8d-8a20-79d6ec004607';
  $pane = new stdClass();
  $pane->pid = 'new-a022d83f-fff0-4308-9937-1eb7e559d144';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2014-02-23',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'a022d83f-fff0-4308-9937-1eb7e559d144';
  $display->content['new-a022d83f-fff0-4308-9937-1eb7e559d144'] = $pane;
  $display->panels['time'][0] = 'new-a022d83f-fff0-4308-9937-1eb7e559d144';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_12x_panel_context_4';
  $handler->task = 'page';
  $handler->subtask = 'schedule_12x';
  $handler->handler = 'panel_context';
  $handler->weight = 3;
  $handler->conf = array(
    'title' => 'Schedule',
    'no_blocks' => 0,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => '',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
  );
  $display = new panels_display();
  $display->layout = 'onecol';
  $display->layout_settings = array();
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'middle' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = '';
  $display->uuid = '60e5fcbe-e623-4a82-bb23-c1bba758f0a9';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-cc1b6f6a-baa7-4e0c-a493-3ae7e241ab2b';
  $pane->panel = 'middle';
  $pane->type = 'block';
  $pane->subtype = 'menu_block-4';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'cc1b6f6a-baa7-4e0c-a493-3ae7e241ab2b';
  $display->content['new-cc1b6f6a-baa7-4e0c-a493-3ae7e241ab2b'] = $pane;
  $display->panels['middle'][0] = 'new-cc1b6f6a-baa7-4e0c-a493-3ae7e241ab2b';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $pages['schedule_12x'] = $page;

  $page = new stdClass();
  $page->disabled = FALSE; /* Edit this to true to make a default page disabled initially */
  $page->api_version = 1;
  $page->name = 'schedule_14x';
  $page->task = 'page';
  $page->admin_title = 'Schedule 14x';
  $page->admin_description = '';
  $page->path = 'scale/14x/schedule/!date';
  $page->access = array(
    'logic' => 'and',
    'plugins' => array(),
  );
  $page->menu = array(
    'type' => 'none',
    'title' => '',
    'name' => 'navigation',
    'weight' => '0',
    'parent' => array(
      'type' => 'none',
      'title' => '',
      'name' => 'navigation',
      'weight' => '0',
    ),
  );
  $page->arguments = array(
    'date' => array(
      'id' => '',
      'identifier' => '',
      'argument' => '',
      'settings' => array(),
    ),
  );
  $page->conf = array(
    'admin_paths' => FALSE,
  );
  $page->default_handlers = array();
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_14x__panel_context_7e3e5946-40c5-40f4-9d40-1e763a5bb9a5';
  $handler->task = 'page';
  $handler->subtask = 'schedule_14x';
  $handler->handler = 'panel_context';
  $handler->weight = -30;
  $handler->conf = array(
    'title' => 'Thursday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/14x/schedule/2016-01-21
scale/14x/schedule/thursday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => '',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Thursday, January 21, 2016';
  $display->uuid = '74d09e49-b32d-462b-a774-255a7daa3064';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-7019fe88-32df-4a12-8961-13085b474420';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '7019fe88-32df-4a12-8961-13085b474420';
  $display->content['new-7019fe88-32df-4a12-8961-13085b474420'] = $pane;
  $display->panels['center'][0] = 'new-7019fe88-32df-4a12-8961-13085b474420';
  $pane = new stdClass();
  $pane->pid = 'new-28084266-30a6-4e84-af9a-1602ac914f49';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '28084266-30a6-4e84-af9a-1602ac914f49';
  $display->content['new-28084266-30a6-4e84-af9a-1602ac914f49'] = $pane;
  $display->panels['center'][1] = 'new-28084266-30a6-4e84-af9a-1602ac914f49';
  $pane = new stdClass();
  $pane->pid = 'new-cf496e31-4304-43e9-8f49-3ac632a41457';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'cf496e31-4304-43e9-8f49-3ac632a41457';
  $display->content['new-cf496e31-4304-43e9-8f49-3ac632a41457'] = $pane;
  $display->panels['center'][2] = 'new-cf496e31-4304-43e9-8f49-3ac632a41457';
  $pane = new stdClass();
  $pane->pid = 'new-c1097979-7f42-4269-b109-9a828393a56a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'c1097979-7f42-4269-b109-9a828393a56a';
  $display->content['new-c1097979-7f42-4269-b109-9a828393a56a'] = $pane;
  $display->panels['center'][3] = 'new-c1097979-7f42-4269-b109-9a828393a56a';
  $pane = new stdClass();
  $pane->pid = 'new-3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $display->content['new-3d0b8d91-105e-4ebf-a34d-d04592b17778'] = $pane;
  $display->panels['center'][4] = 'new-3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $pane = new stdClass();
  $pane->pid = 'new-b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $display->content['new-b7b07f04-d7ba-4bf4-80ed-36c810d02404'] = $pane;
  $display->panels['center'][5] = 'new-b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $pane = new stdClass();
  $pane->pid = 'new-87fa7825-2485-4dde-b694-2e8705094f78';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '87fa7825-2485-4dde-b694-2e8705094f78';
  $display->content['new-87fa7825-2485-4dde-b694-2e8705094f78'] = $pane;
  $display->panels['center'][6] = 'new-87fa7825-2485-4dde-b694-2e8705094f78';
  $pane = new stdClass();
  $pane->pid = 'new-67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $display->content['new-67d369bd-0214-4f47-9fe7-a3efd9bd1448'] = $pane;
  $display->panels['center'][7] = 'new-67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $pane = new stdClass();
  $pane->pid = 'new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = 'd1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $display->content['new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c'] = $pane;
  $display->panels['center'][8] = 'new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $pane = new stdClass();
  $pane->pid = 'new-14a18600-602c-4ca6-b93e-088b1b4fd847';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '14a18600-602c-4ca6-b93e-088b1b4fd847';
  $display->content['new-14a18600-602c-4ca6-b93e-088b1b4fd847'] = $pane;
  $display->panels['center'][9] = 'new-14a18600-602c-4ca6-b93e-088b1b4fd847';
  $pane = new stdClass();
  $pane->pid = 'new-006788ae-cd48-432d-b0c4-53769e75b920';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = '006788ae-cd48-432d-b0c4-53769e75b920';
  $display->content['new-006788ae-cd48-432d-b0c4-53769e75b920'] = $pane;
  $display->panels['center'][10] = 'new-006788ae-cd48-432d-b0c4-53769e75b920';
  $pane = new stdClass();
  $pane->pid = 'new-f35b9931-9754-4b35-82e7-9860abf6eed3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = 'f35b9931-9754-4b35-82e7-9860abf6eed3';
  $display->content['new-f35b9931-9754-4b35-82e7-9860abf6eed3'] = $pane;
  $display->panels['center'][11] = 'new-f35b9931-9754-4b35-82e7-9860abf6eed3';
  $pane = new stdClass();
  $pane->pid = 'new-6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $display->content['new-6b704f2d-6090-4278-974c-11fd69fc8ab0'] = $pane;
  $display->panels['center'][12] = 'new-6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $pane = new stdClass();
  $pane->pid = 'new-5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $display->content['new-5937ede2-1937-4e8a-97dd-45bab880c2c1'] = $pane;
  $display->panels['center'][13] = 'new-5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $pane = new stdClass();
  $pane->pid = 'new-cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = 'cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $display->content['new-cf413f91-2744-4f8a-a958-096bcdf6e0af'] = $pane;
  $display->panels['center'][14] = 'new-cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $pane = new stdClass();
  $pane->pid = 'new-31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $display->content['new-31d95240-34dd-45e1-bb8c-6ce4603935e1'] = $pane;
  $display->panels['center'][15] = 'new-31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $pane = new stdClass();
  $pane->pid = 'new-989252a3-f26b-4725-8ce2-de0988a278a8';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '989252a3-f26b-4725-8ce2-de0988a278a8';
  $display->content['new-989252a3-f26b-4725-8ce2-de0988a278a8'] = $pane;
  $display->panels['center'][16] = 'new-989252a3-f26b-4725-8ce2-de0988a278a8';
  $pane = new stdClass();
  $pane->pid = 'new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $display->content['new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04'] = $pane;
  $display->panels['center'][17] = 'new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $pane = new stdClass();
  $pane->pid = 'new-cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = 'cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $display->content['new-cb940735-a9e6-4c7d-83e2-d1734cc28856'] = $pane;
  $display->panels['center'][18] = 'new-cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $pane = new stdClass();
  $pane->pid = 'new-14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = '14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $display->content['new-14fa296c-167a-4fc0-b57b-5d0a619ad453'] = $pane;
  $display->panels['center'][19] = 'new-14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $pane = new stdClass();
  $pane->pid = 'new-af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $display->content['new-af476e26-48b6-4a07-a1a5-eeda0ee534e4'] = $pane;
  $display->panels['notice'][0] = 'new-af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $pane = new stdClass();
  $pane->pid = 'new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-21',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $display->content['new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c'] = $pane;
  $display->panels['notice'][1] = 'new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $pane = new stdClass();
  $pane->pid = 'new-f6c5749e-aa12-4dc8-a7b6-a8552f5071ed';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-14x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'f6c5749e-aa12-4dc8-a7b6-a8552f5071ed';
  $display->content['new-f6c5749e-aa12-4dc8-a7b6-a8552f5071ed'] = $pane;
  $display->panels['schedule_top'][0] = 'new-f6c5749e-aa12-4dc8-a7b6-a8552f5071ed';
  $pane = new stdClass();
  $pane->pid = 'new-1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-21',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $display->content['new-1bb8d5ab-a435-412d-8169-aae8176ca2e5'] = $pane;
  $display->panels['schedule_top'][1] = 'new-1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $pane = new stdClass();
  $pane->pid = 'new-fd905c81-012b-4b19-ba15-2c475338eb2b';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-21',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'fd905c81-012b-4b19-ba15-2c475338eb2b';
  $display->content['new-fd905c81-012b-4b19-ba15-2c475338eb2b'] = $pane;
  $display->panels['time'][0] = 'new-fd905c81-012b-4b19-ba15-2c475338eb2b';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_14x__friday';
  $handler->task = 'page';
  $handler->subtask = 'schedule_14x';
  $handler->handler = 'panel_context';
  $handler->weight = -29;
  $handler->conf = array(
    'title' => 'Friday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/14x/schedule/2016-01-22
scale/14x/schedule/friday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => 'friday',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Friday, January 22, 2016';
  $display->uuid = '79ad9454-79dd-425a-b258-e6114c1d02c9';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $display->content['new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a'] = $pane;
  $display->panels['center'][0] = 'new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $pane = new stdClass();
  $pane->pid = 'new-9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $display->content['new-9471dc3a-20c3-40bb-b99d-5a872ab965c3'] = $pane;
  $display->panels['center'][1] = 'new-9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $pane = new stdClass();
  $pane->pid = 'new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $display->content['new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38'] = $pane;
  $display->panels['center'][2] = 'new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $pane = new stdClass();
  $pane->pid = 'new-e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $display->content['new-e15658cc-d5e4-41df-8f8e-d097cfe73ced'] = $pane;
  $display->panels['center'][3] = 'new-e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $pane = new stdClass();
  $pane->pid = 'new-09c3a214-1895-479b-b920-022a8e387cb6';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '09c3a214-1895-479b-b920-022a8e387cb6';
  $display->content['new-09c3a214-1895-479b-b920-022a8e387cb6'] = $pane;
  $display->panels['center'][4] = 'new-09c3a214-1895-479b-b920-022a8e387cb6';
  $pane = new stdClass();
  $pane->pid = 'new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $display->content['new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc'] = $pane;
  $display->panels['center'][5] = 'new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $pane = new stdClass();
  $pane->pid = 'new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $display->content['new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0'] = $pane;
  $display->panels['center'][6] = 'new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $pane = new stdClass();
  $pane->pid = 'new-7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $display->content['new-7c751ebc-66c8-4351-9268-86d2bc6d6c38'] = $pane;
  $display->panels['center'][7] = 'new-7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $pane = new stdClass();
  $pane->pid = 'new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = '8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $display->content['new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3'] = $pane;
  $display->panels['center'][8] = 'new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $pane = new stdClass();
  $pane->pid = 'new-de5b16bc-6895-41df-b466-2596d864e889';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = 'de5b16bc-6895-41df-b466-2596d864e889';
  $display->content['new-de5b16bc-6895-41df-b466-2596d864e889'] = $pane;
  $display->panels['center'][9] = 'new-de5b16bc-6895-41df-b466-2596d864e889';
  $pane = new stdClass();
  $pane->pid = 'new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = 'ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $display->content['new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b'] = $pane;
  $display->panels['center'][10] = 'new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $pane = new stdClass();
  $pane->pid = 'new-7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $display->content['new-7f34b3dc-09bd-4d64-b462-71fad3c50e19'] = $pane;
  $display->panels['center'][11] = 'new-7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $pane = new stdClass();
  $pane->pid = 'new-473b98e5-bb55-413d-8c57-95b5b8b43471';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '473b98e5-bb55-413d-8c57-95b5b8b43471';
  $display->content['new-473b98e5-bb55-413d-8c57-95b5b8b43471'] = $pane;
  $display->panels['center'][12] = 'new-473b98e5-bb55-413d-8c57-95b5b8b43471';
  $pane = new stdClass();
  $pane->pid = 'new-31ebcb05-9278-46d7-a64d-6880ee957de2';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '31ebcb05-9278-46d7-a64d-6880ee957de2';
  $display->content['new-31ebcb05-9278-46d7-a64d-6880ee957de2'] = $pane;
  $display->panels['center'][13] = 'new-31ebcb05-9278-46d7-a64d-6880ee957de2';
  $pane = new stdClass();
  $pane->pid = 'new-1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $display->content['new-1d46324b-78df-4532-9b7d-6a0d0045ac15'] = $pane;
  $display->panels['center'][14] = 'new-1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $pane = new stdClass();
  $pane->pid = 'new-6e03024c-09ac-4db5-b898-cc41782d4bff';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '6e03024c-09ac-4db5-b898-cc41782d4bff';
  $display->content['new-6e03024c-09ac-4db5-b898-cc41782d4bff'] = $pane;
  $display->panels['center'][15] = 'new-6e03024c-09ac-4db5-b898-cc41782d4bff';
  $pane = new stdClass();
  $pane->pid = 'new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $display->content['new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e'] = $pane;
  $display->panels['center'][16] = 'new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $pane = new stdClass();
  $pane->pid = 'new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $display->content['new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3'] = $pane;
  $display->panels['center'][17] = 'new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $pane = new stdClass();
  $pane->pid = 'new-5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = '5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $display->content['new-5a9d95cc-cdba-4a34-b417-488e5fb1119d'] = $pane;
  $display->panels['center'][18] = 'new-5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $pane = new stdClass();
  $pane->pid = 'new-fea26346-4edc-48a3-b92b-f0f4912f0283';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = 'fea26346-4edc-48a3-b92b-f0f4912f0283';
  $display->content['new-fea26346-4edc-48a3-b92b-f0f4912f0283'] = $pane;
  $display->panels['center'][19] = 'new-fea26346-4edc-48a3-b92b-f0f4912f0283';
  $pane = new stdClass();
  $pane->pid = 'new-79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22/1632',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 20;
  $pane->locks = array();
  $pane->uuid = '79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $display->content['new-79c15b8a-33d6-4730-adeb-a855ce75d04c'] = $pane;
  $display->panels['center'][20] = 'new-79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $pane = new stdClass();
  $pane->pid = 'new-46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $display->content['new-46671d54-b964-4cd2-b9eb-0f2ef01dd643'] = $pane;
  $display->panels['notice'][0] = 'new-46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $pane = new stdClass();
  $pane->pid = 'new-15af96dd-1dfe-4a32-a031-de9c01b75883';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-22',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '15af96dd-1dfe-4a32-a031-de9c01b75883';
  $display->content['new-15af96dd-1dfe-4a32-a031-de9c01b75883'] = $pane;
  $display->panels['notice'][1] = 'new-15af96dd-1dfe-4a32-a031-de9c01b75883';
  $pane = new stdClass();
  $pane->pid = 'new-a550a754-2922-47f7-baff-8d8233908ae1';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-14x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'a550a754-2922-47f7-baff-8d8233908ae1';
  $display->content['new-a550a754-2922-47f7-baff-8d8233908ae1'] = $pane;
  $display->panels['schedule_top'][0] = 'new-a550a754-2922-47f7-baff-8d8233908ae1';
  $pane = new stdClass();
  $pane->pid = 'new-272a281d-815e-4656-ac51-fe87d1c1bd79';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-22',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '272a281d-815e-4656-ac51-fe87d1c1bd79';
  $display->content['new-272a281d-815e-4656-ac51-fe87d1c1bd79'] = $pane;
  $display->panels['schedule_top'][1] = 'new-272a281d-815e-4656-ac51-fe87d1c1bd79';
  $pane = new stdClass();
  $pane->pid = 'new-95388608-25a7-4abe-90e1-66cecec1b5e4';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-22',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '95388608-25a7-4abe-90e1-66cecec1b5e4';
  $display->content['new-95388608-25a7-4abe-90e1-66cecec1b5e4'] = $pane;
  $display->panels['time'][0] = 'new-95388608-25a7-4abe-90e1-66cecec1b5e4';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_14x__saturday';
  $handler->task = 'page';
  $handler->subtask = 'schedule_14x';
  $handler->handler = 'panel_context';
  $handler->weight = -28;
  $handler->conf = array(
    'title' => 'Saturday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/14x/schedule/2016-01-23
scale/14x/schedule/saturday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => 'saturday',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Saturday, January 23, 2016';
  $display->uuid = 'e19211b3-ed94-4861-b361-7f0243e99fe8';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-b7c65a47-8086-473e-8dcc-babfba43ac15';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'b7c65a47-8086-473e-8dcc-babfba43ac15';
  $display->content['new-b7c65a47-8086-473e-8dcc-babfba43ac15'] = $pane;
  $display->panels['center'][0] = 'new-b7c65a47-8086-473e-8dcc-babfba43ac15';
  $pane = new stdClass();
  $pane->pid = 'new-fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $display->content['new-fa0730e9-6e21-4ce6-9155-65e4b9423b62'] = $pane;
  $display->panels['center'][1] = 'new-fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $pane = new stdClass();
  $pane->pid = 'new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $display->content['new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f'] = $pane;
  $display->panels['center'][2] = 'new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $pane = new stdClass();
  $pane->pid = 'new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $display->content['new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0'] = $pane;
  $display->panels['center'][3] = 'new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $pane = new stdClass();
  $pane->pid = 'new-71b74196-2aa8-45a1-893d-606b63f19245';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '71b74196-2aa8-45a1-893d-606b63f19245';
  $display->content['new-71b74196-2aa8-45a1-893d-606b63f19245'] = $pane;
  $display->panels['center'][4] = 'new-71b74196-2aa8-45a1-893d-606b63f19245';
  $pane = new stdClass();
  $pane->pid = 'new-f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $display->content['new-f8c90745-d66d-467b-bfcd-afe28a84c0b9'] = $pane;
  $display->panels['center'][5] = 'new-f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $pane = new stdClass();
  $pane->pid = 'new-5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $display->content['new-5c28febe-489d-4cf1-89be-d9a14d2d00b1'] = $pane;
  $display->panels['center'][6] = 'new-5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $pane = new stdClass();
  $pane->pid = 'new-5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $display->content['new-5f4e0d4a-5997-481c-b894-77a1cec23cd8'] = $pane;
  $display->panels['center'][7] = 'new-5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $pane = new stdClass();
  $pane->pid = 'new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = '1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $display->content['new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416'] = $pane;
  $display->panels['center'][8] = 'new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $pane = new stdClass();
  $pane->pid = 'new-99d14dcf-8609-4595-9d90-8ef0563c0503';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '99d14dcf-8609-4595-9d90-8ef0563c0503';
  $display->content['new-99d14dcf-8609-4595-9d90-8ef0563c0503'] = $pane;
  $display->panels['center'][9] = 'new-99d14dcf-8609-4595-9d90-8ef0563c0503';
  $pane = new stdClass();
  $pane->pid = 'new-ab78fedb-cc13-48ee-8095-5e0da1534056';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = 'ab78fedb-cc13-48ee-8095-5e0da1534056';
  $display->content['new-ab78fedb-cc13-48ee-8095-5e0da1534056'] = $pane;
  $display->panels['center'][10] = 'new-ab78fedb-cc13-48ee-8095-5e0da1534056';
  $pane = new stdClass();
  $pane->pid = 'new-11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $display->content['new-11d5b50a-bc6f-45a9-882c-8caf92adeba0'] = $pane;
  $display->panels['center'][11] = 'new-11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $pane = new stdClass();
  $pane->pid = 'new-6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $display->content['new-6dc5b21c-6eab-4590-bb48-d89cf958b37f'] = $pane;
  $display->panels['center'][12] = 'new-6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $pane = new stdClass();
  $pane->pid = 'new-184df292-9622-45a8-94b8-0198b467f8d0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '184df292-9622-45a8-94b8-0198b467f8d0';
  $display->content['new-184df292-9622-45a8-94b8-0198b467f8d0'] = $pane;
  $display->panels['center'][13] = 'new-184df292-9622-45a8-94b8-0198b467f8d0';
  $pane = new stdClass();
  $pane->pid = 'new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $display->content['new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1'] = $pane;
  $display->panels['center'][14] = 'new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $pane = new stdClass();
  $pane->pid = 'new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = 'c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $display->content['new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca'] = $pane;
  $display->panels['center'][15] = 'new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $pane = new stdClass();
  $pane->pid = 'new-3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $display->content['new-3c75ab21-f903-4a77-ac57-96f8cee5d81b'] = $pane;
  $display->panels['center'][16] = 'new-3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $pane = new stdClass();
  $pane->pid = 'new-57765160-273d-4923-9f0e-fea332e0a3dd';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '57765160-273d-4923-9f0e-fea332e0a3dd';
  $display->content['new-57765160-273d-4923-9f0e-fea332e0a3dd'] = $pane;
  $display->panels['center'][17] = 'new-57765160-273d-4923-9f0e-fea332e0a3dd';
  $pane = new stdClass();
  $pane->pid = 'new-01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = '01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $display->content['new-01c26c1e-c347-42d9-88a0-b446fc0d494f'] = $pane;
  $display->panels['center'][18] = 'new-01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $pane = new stdClass();
  $pane->pid = 'new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = '5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $display->content['new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56'] = $pane;
  $display->panels['center'][19] = 'new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $pane = new stdClass();
  $pane->pid = 'new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23/1632',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 20;
  $pane->locks = array();
  $pane->uuid = '0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $display->content['new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35'] = $pane;
  $display->panels['center'][20] = 'new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $pane = new stdClass();
  $pane->pid = 'new-bb260660-a7d3-433a-901e-a474d3af3651';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'bb260660-a7d3-433a-901e-a474d3af3651';
  $display->content['new-bb260660-a7d3-433a-901e-a474d3af3651'] = $pane;
  $display->panels['notice'][0] = 'new-bb260660-a7d3-433a-901e-a474d3af3651';
  $pane = new stdClass();
  $pane->pid = 'new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-23',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $display->content['new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66'] = $pane;
  $display->panels['notice'][1] = 'new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $pane = new stdClass();
  $pane->pid = 'new-928ba784-93ad-49b0-bbda-bff0a632d661';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-14x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '928ba784-93ad-49b0-bbda-bff0a632d661';
  $display->content['new-928ba784-93ad-49b0-bbda-bff0a632d661'] = $pane;
  $display->panels['schedule_top'][0] = 'new-928ba784-93ad-49b0-bbda-bff0a632d661';
  $pane = new stdClass();
  $pane->pid = 'new-78df3bcf-816f-4117-bb23-649148fba86d';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-23',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '78df3bcf-816f-4117-bb23-649148fba86d';
  $display->content['new-78df3bcf-816f-4117-bb23-649148fba86d'] = $pane;
  $display->panels['schedule_top'][1] = 'new-78df3bcf-816f-4117-bb23-649148fba86d';
  $pane = new stdClass();
  $pane->pid = 'new-a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-23',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $display->content['new-a5f82299-27ec-4088-a6a9-6d432fd2c405'] = $pane;
  $display->panels['time'][0] = 'new-a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_14x__sunday';
  $handler->task = 'page';
  $handler->subtask = 'schedule_14x';
  $handler->handler = 'panel_context';
  $handler->weight = -27;
  $handler->conf = array(
    'title' => 'Sunday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/14x/schedule/2016-01-24
scale/14x/schedule/sunday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => 'sunday',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Sunday, January 24, 2016';
  $display->uuid = '3a5f9c8f-8be9-45ef-bec1-b065a0d57e76';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-20b5f701-e6ad-461a-82c9-4fde8f1207f3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '20b5f701-e6ad-461a-82c9-4fde8f1207f3';
  $display->content['new-20b5f701-e6ad-461a-82c9-4fde8f1207f3'] = $pane;
  $display->panels['center'][0] = 'new-20b5f701-e6ad-461a-82c9-4fde8f1207f3';
  $pane = new stdClass();
  $pane->pid = 'new-55ac4ff4-5269-451e-8d2a-0edc200bb9b7';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '55ac4ff4-5269-451e-8d2a-0edc200bb9b7';
  $display->content['new-55ac4ff4-5269-451e-8d2a-0edc200bb9b7'] = $pane;
  $display->panels['center'][1] = 'new-55ac4ff4-5269-451e-8d2a-0edc200bb9b7';
  $pane = new stdClass();
  $pane->pid = 'new-16c118b3-2052-4e06-9be4-7f12c8a2181d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = '16c118b3-2052-4e06-9be4-7f12c8a2181d';
  $display->content['new-16c118b3-2052-4e06-9be4-7f12c8a2181d'] = $pane;
  $display->panels['center'][2] = 'new-16c118b3-2052-4e06-9be4-7f12c8a2181d';
  $pane = new stdClass();
  $pane->pid = 'new-6aa278d9-3fb9-4e28-afb7-2aaa43d79951';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '6aa278d9-3fb9-4e28-afb7-2aaa43d79951';
  $display->content['new-6aa278d9-3fb9-4e28-afb7-2aaa43d79951'] = $pane;
  $display->panels['center'][3] = 'new-6aa278d9-3fb9-4e28-afb7-2aaa43d79951';
  $pane = new stdClass();
  $pane->pid = 'new-5bf18f79-5945-4211-83ae-76eff933738a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '5bf18f79-5945-4211-83ae-76eff933738a';
  $display->content['new-5bf18f79-5945-4211-83ae-76eff933738a'] = $pane;
  $display->panels['center'][4] = 'new-5bf18f79-5945-4211-83ae-76eff933738a';
  $pane = new stdClass();
  $pane->pid = 'new-5fb87b8c-23e5-4260-83dd-192e580d2002';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = '5fb87b8c-23e5-4260-83dd-192e580d2002';
  $display->content['new-5fb87b8c-23e5-4260-83dd-192e580d2002'] = $pane;
  $display->panels['center'][5] = 'new-5fb87b8c-23e5-4260-83dd-192e580d2002';
  $pane = new stdClass();
  $pane->pid = 'new-dd46afee-6556-496b-b727-1b106e8eb106';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = 'dd46afee-6556-496b-b727-1b106e8eb106';
  $display->content['new-dd46afee-6556-496b-b727-1b106e8eb106'] = $pane;
  $display->panels['center'][6] = 'new-dd46afee-6556-496b-b727-1b106e8eb106';
  $pane = new stdClass();
  $pane->pid = 'new-6e0aea0e-b30b-4335-a1ba-2c7414ab7e0f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '6e0aea0e-b30b-4335-a1ba-2c7414ab7e0f';
  $display->content['new-6e0aea0e-b30b-4335-a1ba-2c7414ab7e0f'] = $pane;
  $display->panels['center'][7] = 'new-6e0aea0e-b30b-4335-a1ba-2c7414ab7e0f';
  $pane = new stdClass();
  $pane->pid = 'new-1e077ad3-b2bf-4095-9d3a-c784d4e4c802';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = '1e077ad3-b2bf-4095-9d3a-c784d4e4c802';
  $display->content['new-1e077ad3-b2bf-4095-9d3a-c784d4e4c802'] = $pane;
  $display->panels['center'][8] = 'new-1e077ad3-b2bf-4095-9d3a-c784d4e4c802';
  $pane = new stdClass();
  $pane->pid = 'new-96281f21-8980-48b8-b8dc-54537eac5000';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '96281f21-8980-48b8-b8dc-54537eac5000';
  $display->content['new-96281f21-8980-48b8-b8dc-54537eac5000'] = $pane;
  $display->panels['center'][9] = 'new-96281f21-8980-48b8-b8dc-54537eac5000';
  $pane = new stdClass();
  $pane->pid = 'new-8e3e6958-86d5-43e6-8d67-bf46469386af';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = '8e3e6958-86d5-43e6-8d67-bf46469386af';
  $display->content['new-8e3e6958-86d5-43e6-8d67-bf46469386af'] = $pane;
  $display->panels['center'][10] = 'new-8e3e6958-86d5-43e6-8d67-bf46469386af';
  $pane = new stdClass();
  $pane->pid = 'new-16b897e3-7371-48fd-a508-a8abe03c2d81';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '16b897e3-7371-48fd-a508-a8abe03c2d81';
  $display->content['new-16b897e3-7371-48fd-a508-a8abe03c2d81'] = $pane;
  $display->panels['center'][11] = 'new-16b897e3-7371-48fd-a508-a8abe03c2d81';
  $pane = new stdClass();
  $pane->pid = 'new-df3c269b-4c43-48e8-bc66-bd406f406527';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = 'df3c269b-4c43-48e8-bc66-bd406f406527';
  $display->content['new-df3c269b-4c43-48e8-bc66-bd406f406527'] = $pane;
  $display->panels['center'][12] = 'new-df3c269b-4c43-48e8-bc66-bd406f406527';
  $pane = new stdClass();
  $pane->pid = 'new-1e0c81c1-eefd-44af-99ee-35f65858ef97';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '1e0c81c1-eefd-44af-99ee-35f65858ef97';
  $display->content['new-1e0c81c1-eefd-44af-99ee-35f65858ef97'] = $pane;
  $display->panels['center'][13] = 'new-1e0c81c1-eefd-44af-99ee-35f65858ef97';
  $pane = new stdClass();
  $pane->pid = 'new-46d96949-b5d1-4908-a529-f1b194f98a7d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '46d96949-b5d1-4908-a529-f1b194f98a7d';
  $display->content['new-46d96949-b5d1-4908-a529-f1b194f98a7d'] = $pane;
  $display->panels['center'][14] = 'new-46d96949-b5d1-4908-a529-f1b194f98a7d';
  $pane = new stdClass();
  $pane->pid = 'new-db1934ab-a38b-412d-a6bb-69fb3f921a64';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = 'db1934ab-a38b-412d-a6bb-69fb3f921a64';
  $display->content['new-db1934ab-a38b-412d-a6bb-69fb3f921a64'] = $pane;
  $display->panels['center'][15] = 'new-db1934ab-a38b-412d-a6bb-69fb3f921a64';
  $pane = new stdClass();
  $pane->pid = 'new-b0a76fa6-18eb-4338-8cff-55d8b3cf51e5';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = 'b0a76fa6-18eb-4338-8cff-55d8b3cf51e5';
  $display->content['new-b0a76fa6-18eb-4338-8cff-55d8b3cf51e5'] = $pane;
  $display->panels['center'][16] = 'new-b0a76fa6-18eb-4338-8cff-55d8b3cf51e5';
  $pane = new stdClass();
  $pane->pid = 'new-f0be736c-86c2-45c4-85ba-d805d0dd56eb';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = 'f0be736c-86c2-45c4-85ba-d805d0dd56eb';
  $display->content['new-f0be736c-86c2-45c4-85ba-d805d0dd56eb'] = $pane;
  $display->panels['center'][17] = 'new-f0be736c-86c2-45c4-85ba-d805d0dd56eb';
  $pane = new stdClass();
  $pane->pid = 'new-d903ba61-f03b-426c-90bf-eb6e28776fe7';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = 'd903ba61-f03b-426c-90bf-eb6e28776fe7';
  $display->content['new-d903ba61-f03b-426c-90bf-eb6e28776fe7'] = $pane;
  $display->panels['center'][18] = 'new-d903ba61-f03b-426c-90bf-eb6e28776fe7';
  $pane = new stdClass();
  $pane->pid = 'new-cfbf6d31-6d3c-4ea2-9baf-cae5677f750d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = 'cfbf6d31-6d3c-4ea2-9baf-cae5677f750d';
  $display->content['new-cfbf6d31-6d3c-4ea2-9baf-cae5677f750d'] = $pane;
  $display->panels['center'][19] = 'new-cfbf6d31-6d3c-4ea2-9baf-cae5677f750d';
  $pane = new stdClass();
  $pane->pid = 'new-1b71af9a-a14e-4470-876d-5788882c17e1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24/1632',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 20;
  $pane->locks = array();
  $pane->uuid = '1b71af9a-a14e-4470-876d-5788882c17e1';
  $display->content['new-1b71af9a-a14e-4470-876d-5788882c17e1'] = $pane;
  $display->panels['center'][20] = 'new-1b71af9a-a14e-4470-876d-5788882c17e1';
  $pane = new stdClass();
  $pane->pid = 'new-2270ad78-0d5d-4ccc-8186-ed345329401b';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '2270ad78-0d5d-4ccc-8186-ed345329401b';
  $display->content['new-2270ad78-0d5d-4ccc-8186-ed345329401b'] = $pane;
  $display->panels['notice'][0] = 'new-2270ad78-0d5d-4ccc-8186-ed345329401b';
  $pane = new stdClass();
  $pane->pid = 'new-f7836cf9-c6cb-4ae4-a84e-04aa8ad69a68';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-24',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'f7836cf9-c6cb-4ae4-a84e-04aa8ad69a68';
  $display->content['new-f7836cf9-c6cb-4ae4-a84e-04aa8ad69a68'] = $pane;
  $display->panels['notice'][1] = 'new-f7836cf9-c6cb-4ae4-a84e-04aa8ad69a68';
  $pane = new stdClass();
  $pane->pid = 'new-a0be469d-e883-4f4f-be8e-5dc83aef1a75';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-14x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'a0be469d-e883-4f4f-be8e-5dc83aef1a75';
  $display->content['new-a0be469d-e883-4f4f-be8e-5dc83aef1a75'] = $pane;
  $display->panels['schedule_top'][0] = 'new-a0be469d-e883-4f4f-be8e-5dc83aef1a75';
  $pane = new stdClass();
  $pane->pid = 'new-d4b565d6-3d91-4b70-a511-5f150a738557';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2016-01-24',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'd4b565d6-3d91-4b70-a511-5f150a738557';
  $display->content['new-d4b565d6-3d91-4b70-a511-5f150a738557'] = $pane;
  $display->panels['schedule_top'][1] = 'new-d4b565d6-3d91-4b70-a511-5f150a738557';
  $pane = new stdClass();
  $pane->pid = 'new-2ef4a2b7-1c94-4215-89b7-d0cfc8aa77d6';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2016-01-24',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '2ef4a2b7-1c94-4215-89b7-d0cfc8aa77d6';
  $display->content['new-2ef4a2b7-1c94-4215-89b7-d0cfc8aa77d6'] = $pane;
  $display->panels['time'][0] = 'new-2ef4a2b7-1c94-4215-89b7-d0cfc8aa77d6';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_14x__panel_context_e0ab45ff-74b5-4e71-82b5-23c0520a9420';
  $handler->task = 'page';
  $handler->subtask = 'schedule_14x';
  $handler->handler = 'panel_context';
  $handler->weight = -26;
  $handler->conf = array(
    'title' => 'Schedule',
    'no_blocks' => 0,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => '',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'name' => '',
  );
  $display = new panels_display();
  $display->layout = 'onecol';
  $display->layout_settings = array();
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'middle' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Schedules';
  $display->uuid = '27857d73-e62a-4674-b695-c0039cd9d872';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-616b3f43-af54-49a1-9773-0aef59cb4371';
  $pane->panel = 'middle';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-14x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '616b3f43-af54-49a1-9773-0aef59cb4371';
  $display->content['new-616b3f43-af54-49a1-9773-0aef59cb4371'] = $pane;
  $display->panels['middle'][0] = 'new-616b3f43-af54-49a1-9773-0aef59cb4371';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $pages['schedule_14x'] = $page;

  $page = new stdClass();
  $page->disabled = FALSE; /* Edit this to true to make a default page disabled initially */
  $page->api_version = 1;
  $page->name = 'schedule_15x';
  $page->task = 'page';
  $page->admin_title = 'Schedule 15x';
  $page->admin_description = '';
  $page->path = 'scale/15x/schedule/!date';
  $page->access = array(
    'logic' => 'and',
    'plugins' => array(),
  );
  $page->menu = array(
    'type' => 'none',
    'title' => '',
    'name' => 'navigation',
    'weight' => '0',
    'parent' => array(
      'type' => 'none',
      'title' => '',
      'name' => 'navigation',
      'weight' => '0',
    ),
  );
  $page->arguments = array(
    'date' => array(
      'id' => '',
      'identifier' => '',
      'argument' => '',
      'settings' => array(),
    ),
  );
  $page->conf = array(
    'admin_paths' => FALSE,
  );
  $page->default_handlers = array();
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_15x__panel_context_53045609-37c8-4002-a51c-d9d234644d83';
  $handler->task = 'page';
  $handler->subtask = 'schedule_15x';
  $handler->handler = 'panel_context';
  $handler->weight = 0;
  $handler->conf = array(
    'title' => 'Thursday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/15x/schedule/2017-03-02
scale/15x/schedule/thursday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => '',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Thursday, March 2, 2017';
  $display->uuid = '74d09e49-b32d-462b-a774-255a7daa3064';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-7019fe88-32df-4a12-8961-13085b474420';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '7019fe88-32df-4a12-8961-13085b474420';
  $display->content['new-7019fe88-32df-4a12-8961-13085b474420'] = $pane;
  $display->panels['center'][0] = 'new-7019fe88-32df-4a12-8961-13085b474420';
  $pane = new stdClass();
  $pane->pid = 'new-28084266-30a6-4e84-af9a-1602ac914f49';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '28084266-30a6-4e84-af9a-1602ac914f49';
  $display->content['new-28084266-30a6-4e84-af9a-1602ac914f49'] = $pane;
  $display->panels['center'][1] = 'new-28084266-30a6-4e84-af9a-1602ac914f49';
  $pane = new stdClass();
  $pane->pid = 'new-cf496e31-4304-43e9-8f49-3ac632a41457';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'cf496e31-4304-43e9-8f49-3ac632a41457';
  $display->content['new-cf496e31-4304-43e9-8f49-3ac632a41457'] = $pane;
  $display->panels['center'][2] = 'new-cf496e31-4304-43e9-8f49-3ac632a41457';
  $pane = new stdClass();
  $pane->pid = 'new-c1097979-7f42-4269-b109-9a828393a56a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'c1097979-7f42-4269-b109-9a828393a56a';
  $display->content['new-c1097979-7f42-4269-b109-9a828393a56a'] = $pane;
  $display->panels['center'][3] = 'new-c1097979-7f42-4269-b109-9a828393a56a';
  $pane = new stdClass();
  $pane->pid = 'new-3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $display->content['new-3d0b8d91-105e-4ebf-a34d-d04592b17778'] = $pane;
  $display->panels['center'][4] = 'new-3d0b8d91-105e-4ebf-a34d-d04592b17778';
  $pane = new stdClass();
  $pane->pid = 'new-b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $display->content['new-b7b07f04-d7ba-4bf4-80ed-36c810d02404'] = $pane;
  $display->panels['center'][5] = 'new-b7b07f04-d7ba-4bf4-80ed-36c810d02404';
  $pane = new stdClass();
  $pane->pid = 'new-87fa7825-2485-4dde-b694-2e8705094f78';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '87fa7825-2485-4dde-b694-2e8705094f78';
  $display->content['new-87fa7825-2485-4dde-b694-2e8705094f78'] = $pane;
  $display->panels['center'][6] = 'new-87fa7825-2485-4dde-b694-2e8705094f78';
  $pane = new stdClass();
  $pane->pid = 'new-67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $display->content['new-67d369bd-0214-4f47-9fe7-a3efd9bd1448'] = $pane;
  $display->panels['center'][7] = 'new-67d369bd-0214-4f47-9fe7-a3efd9bd1448';
  $pane = new stdClass();
  $pane->pid = 'new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = 'd1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $display->content['new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c'] = $pane;
  $display->panels['center'][8] = 'new-d1df4973-d88e-446e-9fe9-8fd1f11f2b5c';
  $pane = new stdClass();
  $pane->pid = 'new-14a18600-602c-4ca6-b93e-088b1b4fd847';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '14a18600-602c-4ca6-b93e-088b1b4fd847';
  $display->content['new-14a18600-602c-4ca6-b93e-088b1b4fd847'] = $pane;
  $display->panels['center'][9] = 'new-14a18600-602c-4ca6-b93e-088b1b4fd847';
  $pane = new stdClass();
  $pane->pid = 'new-006788ae-cd48-432d-b0c4-53769e75b920';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = '006788ae-cd48-432d-b0c4-53769e75b920';
  $display->content['new-006788ae-cd48-432d-b0c4-53769e75b920'] = $pane;
  $display->panels['center'][10] = 'new-006788ae-cd48-432d-b0c4-53769e75b920';
  $pane = new stdClass();
  $pane->pid = 'new-f35b9931-9754-4b35-82e7-9860abf6eed3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = 'f35b9931-9754-4b35-82e7-9860abf6eed3';
  $display->content['new-f35b9931-9754-4b35-82e7-9860abf6eed3'] = $pane;
  $display->panels['center'][11] = 'new-f35b9931-9754-4b35-82e7-9860abf6eed3';
  $pane = new stdClass();
  $pane->pid = 'new-6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $display->content['new-6b704f2d-6090-4278-974c-11fd69fc8ab0'] = $pane;
  $display->panels['center'][12] = 'new-6b704f2d-6090-4278-974c-11fd69fc8ab0';
  $pane = new stdClass();
  $pane->pid = 'new-5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $display->content['new-5937ede2-1937-4e8a-97dd-45bab880c2c1'] = $pane;
  $display->panels['center'][13] = 'new-5937ede2-1937-4e8a-97dd-45bab880c2c1';
  $pane = new stdClass();
  $pane->pid = 'new-cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = 'cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $display->content['new-cf413f91-2744-4f8a-a958-096bcdf6e0af'] = $pane;
  $display->panels['center'][14] = 'new-cf413f91-2744-4f8a-a958-096bcdf6e0af';
  $pane = new stdClass();
  $pane->pid = 'new-31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $display->content['new-31d95240-34dd-45e1-bb8c-6ce4603935e1'] = $pane;
  $display->panels['center'][15] = 'new-31d95240-34dd-45e1-bb8c-6ce4603935e1';
  $pane = new stdClass();
  $pane->pid = 'new-989252a3-f26b-4725-8ce2-de0988a278a8';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '989252a3-f26b-4725-8ce2-de0988a278a8';
  $display->content['new-989252a3-f26b-4725-8ce2-de0988a278a8'] = $pane;
  $display->panels['center'][16] = 'new-989252a3-f26b-4725-8ce2-de0988a278a8';
  $pane = new stdClass();
  $pane->pid = 'new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $display->content['new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04'] = $pane;
  $display->panels['center'][17] = 'new-7e2c3432-5969-47eb-94e4-7ed94bb7cf04';
  $pane = new stdClass();
  $pane->pid = 'new-cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = 'cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $display->content['new-cb940735-a9e6-4c7d-83e2-d1734cc28856'] = $pane;
  $display->panels['center'][18] = 'new-cb940735-a9e6-4c7d-83e2-d1734cc28856';
  $pane = new stdClass();
  $pane->pid = 'new-14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = '14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $display->content['new-14fa296c-167a-4fc0-b57b-5d0a619ad453'] = $pane;
  $display->panels['center'][19] = 'new-14fa296c-167a-4fc0-b57b-5d0a619ad453';
  $pane = new stdClass();
  $pane->pid = 'new-af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $display->content['new-af476e26-48b6-4a07-a1a5-eeda0ee534e4'] = $pane;
  $display->panels['notice'][0] = 'new-af476e26-48b6-4a07-a1a5-eeda0ee534e4';
  $pane = new stdClass();
  $pane->pid = 'new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-02',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $display->content['new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c'] = $pane;
  $display->panels['notice'][1] = 'new-bfe65b0b-4d4a-4347-b68e-adfa43e4416c';
  $pane = new stdClass();
  $pane->pid = 'new-32d79e43-fd0c-44cf-8223-541d8c3b11de';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-15x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '32d79e43-fd0c-44cf-8223-541d8c3b11de';
  $display->content['new-32d79e43-fd0c-44cf-8223-541d8c3b11de'] = $pane;
  $display->panels['schedule_top'][0] = 'new-32d79e43-fd0c-44cf-8223-541d8c3b11de';
  $pane = new stdClass();
  $pane->pid = 'new-1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-02',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $display->content['new-1bb8d5ab-a435-412d-8169-aae8176ca2e5'] = $pane;
  $display->panels['schedule_top'][1] = 'new-1bb8d5ab-a435-412d-8169-aae8176ca2e5';
  $pane = new stdClass();
  $pane->pid = 'new-fd905c81-012b-4b19-ba15-2c475338eb2b';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-02',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'fd905c81-012b-4b19-ba15-2c475338eb2b';
  $display->content['new-fd905c81-012b-4b19-ba15-2c475338eb2b'] = $pane;
  $display->panels['time'][0] = 'new-fd905c81-012b-4b19-ba15-2c475338eb2b';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_15x__panel_context_72f14d88-99cd-451e-b61a-278cbb0894c9';
  $handler->task = 'page';
  $handler->subtask = 'schedule_15x';
  $handler->handler = 'panel_context';
  $handler->weight = 1;
  $handler->conf = array(
    'title' => 'Friday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/15x/schedule/2017-03-03
scale/15x/schedule/friday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => '',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Friday, March 3, 2017';
  $display->uuid = '79ad9454-79dd-425a-b258-e6114c1d02c9';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $display->content['new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a'] = $pane;
  $display->panels['center'][0] = 'new-40f8e6c3-ea9c-4473-bcac-002a7d30c74a';
  $pane = new stdClass();
  $pane->pid = 'new-9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $display->content['new-9471dc3a-20c3-40bb-b99d-5a872ab965c3'] = $pane;
  $display->panels['center'][1] = 'new-9471dc3a-20c3-40bb-b99d-5a872ab965c3';
  $pane = new stdClass();
  $pane->pid = 'new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $display->content['new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38'] = $pane;
  $display->panels['center'][2] = 'new-bbcc911a-1cdc-4dbe-9453-f8ff31670f38';
  $pane = new stdClass();
  $pane->pid = 'new-e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = 'e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $display->content['new-e15658cc-d5e4-41df-8f8e-d097cfe73ced'] = $pane;
  $display->panels['center'][3] = 'new-e15658cc-d5e4-41df-8f8e-d097cfe73ced';
  $pane = new stdClass();
  $pane->pid = 'new-09c3a214-1895-479b-b920-022a8e387cb6';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '09c3a214-1895-479b-b920-022a8e387cb6';
  $display->content['new-09c3a214-1895-479b-b920-022a8e387cb6'] = $pane;
  $display->panels['center'][4] = 'new-09c3a214-1895-479b-b920-022a8e387cb6';
  $pane = new stdClass();
  $pane->pid = 'new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $display->content['new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc'] = $pane;
  $display->panels['center'][5] = 'new-b4f57f79-27ba-4e71-8cb2-4c68d9c368cc';
  $pane = new stdClass();
  $pane->pid = 'new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $display->content['new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0'] = $pane;
  $display->panels['center'][6] = 'new-6bbe7b18-3d0b-4e90-be43-3a7222fabea0';
  $pane = new stdClass();
  $pane->pid = 'new-7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $display->content['new-7c751ebc-66c8-4351-9268-86d2bc6d6c38'] = $pane;
  $display->panels['center'][7] = 'new-7c751ebc-66c8-4351-9268-86d2bc6d6c38';
  $pane = new stdClass();
  $pane->pid = 'new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = '8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $display->content['new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3'] = $pane;
  $display->panels['center'][8] = 'new-8e5bdc11-85df-4ba5-bf65-ecb2697382f3';
  $pane = new stdClass();
  $pane->pid = 'new-de5b16bc-6895-41df-b466-2596d864e889';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = 'de5b16bc-6895-41df-b466-2596d864e889';
  $display->content['new-de5b16bc-6895-41df-b466-2596d864e889'] = $pane;
  $display->panels['center'][9] = 'new-de5b16bc-6895-41df-b466-2596d864e889';
  $pane = new stdClass();
  $pane->pid = 'new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = 'ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $display->content['new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b'] = $pane;
  $display->panels['center'][10] = 'new-ce1e1cc6-0f1c-44c6-9e33-6add1516020b';
  $pane = new stdClass();
  $pane->pid = 'new-7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $display->content['new-7f34b3dc-09bd-4d64-b462-71fad3c50e19'] = $pane;
  $display->panels['center'][11] = 'new-7f34b3dc-09bd-4d64-b462-71fad3c50e19';
  $pane = new stdClass();
  $pane->pid = 'new-473b98e5-bb55-413d-8c57-95b5b8b43471';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '473b98e5-bb55-413d-8c57-95b5b8b43471';
  $display->content['new-473b98e5-bb55-413d-8c57-95b5b8b43471'] = $pane;
  $display->panels['center'][12] = 'new-473b98e5-bb55-413d-8c57-95b5b8b43471';
  $pane = new stdClass();
  $pane->pid = 'new-31ebcb05-9278-46d7-a64d-6880ee957de2';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '31ebcb05-9278-46d7-a64d-6880ee957de2';
  $display->content['new-31ebcb05-9278-46d7-a64d-6880ee957de2'] = $pane;
  $display->panels['center'][13] = 'new-31ebcb05-9278-46d7-a64d-6880ee957de2';
  $pane = new stdClass();
  $pane->pid = 'new-1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $display->content['new-1d46324b-78df-4532-9b7d-6a0d0045ac15'] = $pane;
  $display->panels['center'][14] = 'new-1d46324b-78df-4532-9b7d-6a0d0045ac15';
  $pane = new stdClass();
  $pane->pid = 'new-6e03024c-09ac-4db5-b898-cc41782d4bff';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = '6e03024c-09ac-4db5-b898-cc41782d4bff';
  $display->content['new-6e03024c-09ac-4db5-b898-cc41782d4bff'] = $pane;
  $display->panels['center'][15] = 'new-6e03024c-09ac-4db5-b898-cc41782d4bff';
  $pane = new stdClass();
  $pane->pid = 'new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $display->content['new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e'] = $pane;
  $display->panels['center'][16] = 'new-0ecb5db9-92ae-47d0-9af1-e1f2bab7a66e';
  $pane = new stdClass();
  $pane->pid = 'new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $display->content['new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3'] = $pane;
  $display->panels['center'][17] = 'new-28a98814-4c8c-4af4-bc19-4a3b7c948ad3';
  $pane = new stdClass();
  $pane->pid = 'new-5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = '5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $display->content['new-5a9d95cc-cdba-4a34-b417-488e5fb1119d'] = $pane;
  $display->panels['center'][18] = 'new-5a9d95cc-cdba-4a34-b417-488e5fb1119d';
  $pane = new stdClass();
  $pane->pid = 'new-fea26346-4edc-48a3-b92b-f0f4912f0283';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = 'fea26346-4edc-48a3-b92b-f0f4912f0283';
  $display->content['new-fea26346-4edc-48a3-b92b-f0f4912f0283'] = $pane;
  $display->panels['center'][19] = 'new-fea26346-4edc-48a3-b92b-f0f4912f0283';
  $pane = new stdClass();
  $pane->pid = 'new-79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03/1632',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 20;
  $pane->locks = array();
  $pane->uuid = '79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $display->content['new-79c15b8a-33d6-4730-adeb-a855ce75d04c'] = $pane;
  $display->panels['center'][20] = 'new-79c15b8a-33d6-4730-adeb-a855ce75d04c';
  $pane = new stdClass();
  $pane->pid = 'new-46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $display->content['new-46671d54-b964-4cd2-b9eb-0f2ef01dd643'] = $pane;
  $display->panels['notice'][0] = 'new-46671d54-b964-4cd2-b9eb-0f2ef01dd643';
  $pane = new stdClass();
  $pane->pid = 'new-15af96dd-1dfe-4a32-a031-de9c01b75883';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-03',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '15af96dd-1dfe-4a32-a031-de9c01b75883';
  $display->content['new-15af96dd-1dfe-4a32-a031-de9c01b75883'] = $pane;
  $display->panels['notice'][1] = 'new-15af96dd-1dfe-4a32-a031-de9c01b75883';
  $pane = new stdClass();
  $pane->pid = 'new-ebb0dbec-36a1-4c47-8c8e-c99a3953049f';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-15x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'ebb0dbec-36a1-4c47-8c8e-c99a3953049f';
  $display->content['new-ebb0dbec-36a1-4c47-8c8e-c99a3953049f'] = $pane;
  $display->panels['schedule_top'][0] = 'new-ebb0dbec-36a1-4c47-8c8e-c99a3953049f';
  $pane = new stdClass();
  $pane->pid = 'new-272a281d-815e-4656-ac51-fe87d1c1bd79';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-03',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '272a281d-815e-4656-ac51-fe87d1c1bd79';
  $display->content['new-272a281d-815e-4656-ac51-fe87d1c1bd79'] = $pane;
  $display->panels['schedule_top'][1] = 'new-272a281d-815e-4656-ac51-fe87d1c1bd79';
  $pane = new stdClass();
  $pane->pid = 'new-95388608-25a7-4abe-90e1-66cecec1b5e4';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-03',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '95388608-25a7-4abe-90e1-66cecec1b5e4';
  $display->content['new-95388608-25a7-4abe-90e1-66cecec1b5e4'] = $pane;
  $display->panels['time'][0] = 'new-95388608-25a7-4abe-90e1-66cecec1b5e4';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
  $handler = new stdClass();
  $handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
  $handler->api_version = 1;
  $handler->name = 'page_schedule_15x__panel_context_f8bb805b-4282-402e-af68-4ca8a787d578';
  $handler->task = 'page';
  $handler->subtask = 'schedule_15x';
  $handler->handler = 'panel_context';
  $handler->weight = 2;
  $handler->conf = array(
    'title' => 'Saturday',
    'no_blocks' => 1,
    'pipeline' => 'standard',
    'body_classes_to_remove' => '',
    'body_classes_to_add' => 'schedule_11x friday',
    'css_id' => '',
    'css' => '',
    'contexts' => array(),
    'relationships' => array(),
    'access' => array(
      'logic' => 'and',
      'plugins' => array(
        0 => array(
          'name' => 'path_visibility',
          'settings' => array(
            'visibility_setting' => '1',
            'paths' => 'scale/15x/schedule/2017-03-04
scale/15x/schedule/saturday',
          ),
          'context' => 'empty',
          'not' => FALSE,
        ),
      ),
    ),
    'name' => '',
  );
  $display = new panels_display();
  $display->layout = 'flexible';
  $display->layout_settings = array(
    'items' => array(
      'canvas' => array(
        'type' => 'row',
        'contains' => 'column',
        'children' => array(
          0 => 'main',
        ),
        'parent' => NULL,
      ),
      'main' => array(
        'type' => 'column',
        'width' => 100,
        'width_type' => '%',
        'children' => array(
          0 => 2,
          1 => 'main-row',
          2 => 1,
        ),
        'parent' => 'canvas',
      ),
      'main-row' => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'time',
          1 => 'center',
        ),
        'parent' => 'main',
        'class' => 'row-main',
      ),
      'center' => array(
        'type' => 'region',
        'title' => 'Rooms',
        'width' => '100',
        'width_type' => '%',
        'parent' => 'main-row',
        'class' => 'region-rooms',
      ),
      'time' => array(
        'type' => 'region',
        'title' => 'Time',
        'width' => '50',
        'width_type' => 'px',
        'parent' => 'main-row',
        'class' => 'region-time',
      ),
      1 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'notice',
        ),
        'parent' => 'main',
        'class' => 'row-notice',
      ),
      'notice' => array(
        'type' => 'region',
        'title' => 'Notice',
        'width' => 100,
        'width_type' => '%',
        'parent' => '1',
        'class' => 'schedule-notice',
      ),
      2 => array(
        'type' => 'row',
        'contains' => 'region',
        'children' => array(
          0 => 'schedule_top',
        ),
        'parent' => 'main',
        'class' => 'row-schedule-top',
      ),
      'schedule_top' => array(
        'type' => 'region',
        'title' => 'Schedule Top',
        'width' => 100,
        'width_type' => '%',
        'parent' => '2',
        'class' => 'schedule-top',
      ),
    ),
  );
  $display->panel_settings = array(
    'style_settings' => array(
      'default' => NULL,
      'center' => NULL,
      'time' => NULL,
      'notice' => NULL,
      'schedule_top' => NULL,
    ),
  );
  $display->cache = array();
  $display->title = 'Saturday, March 4, 2017';
  $display->uuid = 'e19211b3-ed94-4861-b361-7f0243e99fe8';
  $display->storage_type = '';
  $display->storage_id = '';
  $display->content = array();
  $display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-b7c65a47-8086-473e-8dcc-babfba43ac15';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1592',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'la-jolla',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'b7c65a47-8086-473e-8dcc-babfba43ac15';
  $display->content['new-b7c65a47-8086-473e-8dcc-babfba43ac15'] = $pane;
  $display->panels['center'][0] = 'new-b7c65a47-8086-473e-8dcc-babfba43ac15';
  $pane = new stdClass();
  $pane->pid = 'new-fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1593',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'carmel',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = 'fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $display->content['new-fa0730e9-6e21-4ce6-9155-65e4b9423b62'] = $pane;
  $display->panels['center'][1] = 'new-fa0730e9-6e21-4ce6-9155-65e4b9423b62';
  $pane = new stdClass();
  $pane->pid = 'new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1594',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $display->content['new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f'] = $pane;
  $display->panels['center'][2] = 'new-ec264dfb-4cdf-4b79-b37d-0cde142aa07f';
  $pane = new stdClass();
  $pane->pid = 'new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1595',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $display->content['new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0'] = $pane;
  $display->panels['center'][3] = 'new-908a3bd2-05d4-4080-aa50-532fc3b6a5b0';
  $pane = new stdClass();
  $pane->pid = 'new-71b74196-2aa8-45a1-893d-606b63f19245';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1596',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'los-angeles-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '71b74196-2aa8-45a1-893d-606b63f19245';
  $display->content['new-71b74196-2aa8-45a1-893d-606b63f19245'] = $pane;
  $display->panels['center'][4] = 'new-71b74196-2aa8-45a1-893d-606b63f19245';
  $pane = new stdClass();
  $pane->pid = 'new-f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1597',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-ab',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 5;
  $pane->locks = array();
  $pane->uuid = 'f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $display->content['new-f8c90745-d66d-467b-bfcd-afe28a84c0b9'] = $pane;
  $display->panels['center'][5] = 'new-f8c90745-d66d-467b-bfcd-afe28a84c0b9';
  $pane = new stdClass();
  $pane->pid = 'new-5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1599',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'century-cd',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 6;
  $pane->locks = array();
  $pane->uuid = '5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $display->content['new-5c28febe-489d-4cf1-89be-d9a14d2d00b1'] = $pane;
  $display->panels['center'][6] = 'new-5c28febe-489d-4cf1-89be-d9a14d2d00b1';
  $pane = new stdClass();
  $pane->pid = 'new-5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1598',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'marina',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 7;
  $pane->locks = array();
  $pane->uuid = '5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $display->content['new-5f4e0d4a-5997-481c-b894-77a1cec23cd8'] = $pane;
  $display->panels['center'][7] = 'new-5f4e0d4a-5997-481c-b894-77a1cec23cd8';
  $pane = new stdClass();
  $pane->pid = 'new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1610',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'bel-air',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 8;
  $pane->locks = array();
  $pane->uuid = '1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $display->content['new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416'] = $pane;
  $display->panels['center'][8] = 'new-1e2fd2d6-9d44-4db1-b9a4-9bf5397ea416';
  $pane = new stdClass();
  $pane->pid = 'new-99d14dcf-8609-4595-9d90-8ef0563c0503';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1611',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-a',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 9;
  $pane->locks = array();
  $pane->uuid = '99d14dcf-8609-4595-9d90-8ef0563c0503';
  $display->content['new-99d14dcf-8609-4595-9d90-8ef0563c0503'] = $pane;
  $display->panels['center'][9] = 'new-99d14dcf-8609-4595-9d90-8ef0563c0503';
  $pane = new stdClass();
  $pane->pid = 'new-ab78fedb-cc13-48ee-8095-5e0da1534056';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1600',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'santa-monica-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 10;
  $pane->locks = array();
  $pane->uuid = 'ab78fedb-cc13-48ee-8095-5e0da1534056';
  $display->content['new-ab78fedb-cc13-48ee-8095-5e0da1534056'] = $pane;
  $display->panels['center'][10] = 'new-ab78fedb-cc13-48ee-8095-5e0da1534056';
  $pane = new stdClass();
  $pane->pid = 'new-11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1601',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-b',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 11;
  $pane->locks = array();
  $pane->uuid = '11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $display->content['new-11d5b50a-bc6f-45a9-882c-8caf92adeba0'] = $pane;
  $display->panels['center'][11] = 'new-11d5b50a-bc6f-45a9-882c-8caf92adeba0';
  $pane = new stdClass();
  $pane->pid = 'new-6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1602',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-c',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 12;
  $pane->locks = array();
  $pane->uuid = '6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $display->content['new-6dc5b21c-6eab-4590-bb48-d89cf958b37f'] = $pane;
  $display->panels['center'][12] = 'new-6dc5b21c-6eab-4590-bb48-d89cf958b37f';
  $pane = new stdClass();
  $pane->pid = 'new-184df292-9622-45a8-94b8-0198b467f8d0';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1603',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-d',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 13;
  $pane->locks = array();
  $pane->uuid = '184df292-9622-45a8-94b8-0198b467f8d0';
  $display->content['new-184df292-9622-45a8-94b8-0198b467f8d0'] = $pane;
  $display->panels['center'][13] = 'new-184df292-9622-45a8-94b8-0198b467f8d0';
  $pane = new stdClass();
  $pane->pid = 'new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1604',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-e',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 14;
  $pane->locks = array();
  $pane->uuid = '0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $display->content['new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1'] = $pane;
  $display->panels['center'][14] = 'new-0e7eaf3e-d674-43dd-b55a-017dcc6525f1';
  $pane = new stdClass();
  $pane->pid = 'new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1605',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'san-lorenzo-f',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 15;
  $pane->locks = array();
  $pane->uuid = 'c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $display->content['new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca'] = $pane;
  $display->panels['center'][15] = 'new-c7e842f3-8fc6-428b-8ed6-6d358b2291ca';
  $pane = new stdClass();
  $pane->pid = 'new-3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1606',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 16;
  $pane->locks = array();
  $pane->uuid = '3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $display->content['new-3c75ab21-f903-4a77-ac57-96f8cee5d81b'] = $pane;
  $display->panels['center'][16] = 'new-3c75ab21-f903-4a77-ac57-96f8cee5d81b';
  $pane = new stdClass();
  $pane->pid = 'new-57765160-273d-4923-9f0e-fea332e0a3dd';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1607',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 17;
  $pane->locks = array();
  $pane->uuid = '57765160-273d-4923-9f0e-fea332e0a3dd';
  $display->content['new-57765160-273d-4923-9f0e-fea332e0a3dd'] = $pane;
  $display->panels['center'][17] = 'new-57765160-273d-4923-9f0e-fea332e0a3dd';
  $pane = new stdClass();
  $pane->pid = 'new-01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1608',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 18;
  $pane->locks = array();
  $pane->uuid = '01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $display->content['new-01c26c1e-c347-42d9-88a0-b446fc0d494f'] = $pane;
  $display->panels['center'][18] = 'new-01c26c1e-c347-42d9-88a0-b446fc0d494f';
  $pane = new stdClass();
  $pane->pid = 'new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1609',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 19;
  $pane->locks = array();
  $pane->uuid = '5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $display->content['new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56'] = $pane;
  $display->panels['center'][19] = 'new-5f6e712d-1d15-4ef2-ac05-2c3a18292e56';
  $pane = new stdClass();
  $pane->pid = 'new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $pane->panel = 'center';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04/1632',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 20;
  $pane->locks = array();
  $pane->uuid = '0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $display->content['new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35'] = $pane;
  $display->panels['center'][20] = 'new-0d3c45b5-be95-4942-9aff-b3d1b81bbe35';
  $pane = new stdClass();
  $pane->pid = 'new-bb260660-a7d3-433a-901e-a474d3af3651';
  $pane->panel = 'notice';
  $pane->type = 'custom';
  $pane->subtype = 'custom';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'admin_title' => 'Schedule change notice',
    'title' => '',
    'body' => '<p>* The schedule of events is subjected to change without prior notifications.</p>',
    'format' => 'filtered_html',
    'substitute' => TRUE,
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'bb260660-a7d3-433a-901e-a474d3af3651';
  $display->content['new-bb260660-a7d3-433a-901e-a474d3af3651'] = $pane;
  $display->panels['notice'][0] = 'new-bb260660-a7d3-433a-901e-a474d3af3651';
  $pane = new stdClass();
  $pane->pid = 'new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $pane->panel = 'notice';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-04',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $display->content['new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66'] = $pane;
  $display->panels['notice'][1] = 'new-3f2f8597-1a73-44bb-ade7-66ee50dd6b66';
  $pane = new stdClass();
  $pane->pid = 'new-bb0bbdc2-f923-43c9-b177-69a0b63dd2c3';
  $pane->panel = 'schedule_top';
  $pane->type = 'block';
  $pane->subtype = 'menu-menu-schedule-15x';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'bb0bbdc2-f923-43c9-b177-69a0b63dd2c3';
  $display->content['new-bb0bbdc2-f923-43c9-b177-69a0b63dd2c3'] = $pane;
  $display->panels['schedule_top'][0] = 'new-bb0bbdc2-f923-43c9-b177-69a0b63dd2c3';
  $pane = new stdClass();
  $pane->pid = 'new-78df3bcf-816f-4117-bb23-649148fba86d';
  $pane->panel = 'schedule_top';
  $pane->type = 'views_panes';
  $pane->subtype = 'room_schedule_legend-panel_pane_1';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'arguments' => array(
      'field_time_value' => '2017-03-04',
    ),
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '78df3bcf-816f-4117-bb23-649148fba86d';
  $display->content['new-78df3bcf-816f-4117-bb23-649148fba86d'] = $pane;
  $display->panels['schedule_top'][1] = 'new-78df3bcf-816f-4117-bb23-649148fba86d';
  $pane = new stdClass();
  $pane->pid = 'new-a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $pane->panel = 'time';
  $pane->type = 'views';
  $pane->subtype = 'room_schedule';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'override_pager_settings' => 0,
    'use_pager' => 0,
    'nodes_per_page' => '0',
    'pager_id' => '0',
    'offset' => '0',
    'more_link' => 0,
    'feed_icons' => 0,
    'panel_args' => 0,
    'link_to_view' => 0,
    'args' => '2017-03-04',
    'url' => '',
    'display' => 'page_3',
    'override_title' => 1,
    'override_title_text' => 'Time',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => 'time',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $display->content['new-a5f82299-27ec-4088-a6a9-6d432fd2c405'] = $pane;
  $display->panels['time'][0] = 'new-a5f82299-27ec-4088-a6a9-6d432fd2c405';
  $display->hide_title = PANELS_TITLE_FIXED;
  $display->title_pane = '0';
  $handler->conf['display'] = $display;
  $page->default_handlers[$handler->name] = $handler;
